; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	satellite4 - satellite
	instrument9 - instrument
	instrument10 - instrument
	image5 - mode
	spectrograph3 - mode
	thermograph1 - mode
	thermograph4 - mode
	thermograph0 - mode
	spectrograph2 - mode
	GroundStation1 - direction
	GroundStation0 - direction
	GroundStation2 - direction
	GroundStation3 - direction
	GroundStation5 - direction
	Star4 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Star8 - direction
	Planet9 - direction
	Phenomenon10 - direction
)
(:init
	(supports instrument0 thermograph0)
	(calibration_target instrument0 GroundStation0)
	(calibration_target instrument0 GroundStation1)
	(supports instrument1 spectrograph3)
	(supports instrument1 thermograph0)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 GroundStation0)
	(calibration_target instrument1 GroundStation2)
	(supports instrument2 thermograph0)
	(supports instrument2 thermograph1)
	(supports instrument2 thermograph4)
	(calibration_target instrument2 GroundStation2)
	(calibration_target instrument2 GroundStation0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star4)
	(supports instrument3 thermograph0)
	(supports instrument3 thermograph1)
	(supports instrument3 thermograph4)
	(calibration_target instrument3 GroundStation0)
	(calibration_target instrument3 GroundStation2)
	(supports instrument4 thermograph0)
	(calibration_target instrument4 Star4)
	(calibration_target instrument4 GroundStation0)
	(supports instrument5 image5)
	(supports instrument5 spectrograph3)
	(supports instrument5 thermograph1)
	(calibration_target instrument5 GroundStation3)
	(calibration_target instrument5 GroundStation2)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon10)
	(supports instrument6 spectrograph2)
	(calibration_target instrument6 GroundStation5)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation3)
	(supports instrument7 thermograph1)
	(calibration_target instrument7 GroundStation5)
	(calibration_target instrument7 Star4)
	(supports instrument8 thermograph4)
	(calibration_target instrument8 Star4)
	(calibration_target instrument8 GroundStation5)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation0)
	(supports instrument9 image5)
	(supports instrument9 spectrograph3)
	(calibration_target instrument9 GroundStation3)
	(calibration_target instrument9 Star4)
	(supports instrument10 spectrograph2)
	(supports instrument10 image5)
	(supports instrument10 thermograph1)
	(calibration_target instrument10 Star4)
	(calibration_target instrument10 GroundStation5)
	(on_board instrument9 satellite4)
	(on_board instrument10 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation2)
)
(:goal (and
	(pointing satellite2 GroundStation1)
	(pointing satellite3 GroundStation1)
	(have_image Phenomenon6 image5)
	(have_image Planet7 image5)
	(have_image Planet7 spectrograph3)
	(have_image Star8 spectrograph2)
	(have_image Planet9 thermograph4)
	(have_image Phenomenon10 spectrograph2)
	(have_image Phenomenon10 image5)
))

)

; plan
1. (turn_to satellite4 groundstation5 groundstation2)
   deleted: (pointing satellite4 groundstation2)
   added: (pointing satellite4 groundstation5)
   goals met: 0 of 9
2. (switch_on instrument10 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument10)
   goals met: 0 of 9
3. (calibrate satellite4 instrument10 groundstation5)
   added: (calibrated instrument10)
   goals met: 0 of 9
4. (turn_to satellite4 phenomenon10 groundstation5)
   deleted: (pointing satellite4 groundstation5)
   added: (pointing satellite4 phenomenon10)
   goals met: 0 of 9
5. (turn_to satellite2 groundstation1 groundstation3)
   deleted: (pointing satellite2 groundstation3)
   added: (pointing satellite2 groundstation1)
   goals met: 1 of 9
6. (turn_to satellite1 groundstation2 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 groundstation2)
   goals met: 1 of 9
7. (turn_to satellite0 groundstation0 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 groundstation0)
   goals met: 1 of 9
8. (take_image satellite4 phenomenon10 instrument10 spectrograph2)
   added: (have_image phenomenon10 spectrograph2)
   goals met: 2 of 9
9. (take_image satellite4 phenomenon10 instrument10 image5)
   added: (have_image phenomenon10 image5)
   goals met: 3 of 9
10. (switch_on instrument5 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument5)
   goals met: 3 of 9
11. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 3 of 9
12. (calibrate satellite1 instrument5 groundstation2)
   added: (calibrated instrument5)
   goals met: 3 of 9
13. (calibrate satellite0 instrument2 groundstation0)
   added: (calibrated instrument2)
   goals met: 3 of 9
14. (turn_to satellite0 planet9 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 planet9)
   goals met: 3 of 9
15. (take_image satellite0 planet9 instrument2 thermograph4)
   added: (have_image planet9 thermograph4)
   goals met: 4 of 9
16. (turn_to satellite1 phenomenon6 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 phenomenon6)
   goals met: 4 of 9
17. (take_image satellite1 phenomenon6 instrument5 image5)
   added: (have_image phenomenon6 image5)
   goals met: 5 of 9
18. (turn_to satellite1 planet7 phenomenon6)
   deleted: (pointing satellite1 phenomenon6)
   added: (pointing satellite1 planet7)
   goals met: 5 of 9
19. (take_image satellite1 planet7 instrument5 image5)
   added: (have_image planet7 image5)
   goals met: 6 of 9
20. (take_image satellite1 planet7 instrument5 spectrograph3)
   added: (have_image planet7 spectrograph3)
   goals met: 7 of 9
21. (turn_to satellite3 groundstation1 groundstation0)
   deleted: (pointing satellite3 groundstation0)
   added: (pointing satellite3 groundstation1)
   goals met: 8 of 9
22. (turn_to satellite4 star8 phenomenon10)
   deleted: (pointing satellite4 phenomenon10)
   added: (pointing satellite4 star8)
   goals met: 8 of 9
23. (take_image satellite4 star8 instrument10 spectrograph2)
   added: (have_image star8 spectrograph2)
   goals met: 9 of 9
